Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/wikimediav20210402(2.8k)/en-ne.tmx
Source language: en
Languages: ne

source: Thapa later claimed that he borrowed the money for his personal use, and such a revelation would not tarnish the image of Nepal and Nepali football.[4]
ne: थापाले पछि दावी गरे कि उनले त्यो पैसा आफ्नो व्यक्तिगत प्रयोगका लागि सापट लिएका थिए, र यस्तो खुलासाले नेपाल र नेपाली फुटबलको छवि बिगार्न सक्दैन। [१]

source: In November 2015 the FIFA Ethics Committee banned him for 10 years.[6][7]
ne: नोभेम्बर २०१९ मा, फिफा आचार संहिता समितिले उनलाई १० बर्षको लागि प्रतिबन्ध लगायो। [१] [२]

source: Thapa is the younger brother of Kamal Thapa.
ne: थापा कमल थापाको कान्छो भाइ हुन्।

source: Before becoming the president of ANFA, Thapa was a national football player. He also played in the East Bengal FC team.
ne: एन्फाको अध्यक्ष हुनु भन्दा अघि थापा राष्ट्रिय फुटबल खेलाडी थिए। उनले पूर्वी बंगाल एफसी टिमबाट खेले।

source: Changes to the Nepali football made under Thapa
ne: थापा अन्तर्गत नेपाली फुटबलमा परिवर्तन

source: Started the already stopped ANFA Martyr's Memorial A-Division League Created ANFA Youth Academy Gave special focus to youth football Tried to make Nepali Football League system more professional Development of Nepali Football Better facilities and better rewards for players
ne: पहिले नै रोकिएको एन्फा शहीद स्मारक ए-डिभिजन लिग सुरू एन्फा युवा एकेडेमी बनाईयो युवा फुटबल मा विशेष ध्यान दिए नेपाली फुटबल लीग प्रणालीलाई अधिक व्यावसायिक बनाउन प्रयास गरे नेपाली फुटबलको विकास राम्रो सुविधा र खेलाडीहरूको लागि राम्रो पुरस्कार

source: Following the corruption case of Mohammed bin Hammam, The Associated Press revealed that Thapa received an illegal gift of $100,000 from bin Hammam in 2009. The money was deposited into the personal bank account of Thapa's son, Gaurav Thapa.[1][5]
ne: २००९ मा एसियाली फुटबल महासंघ (एएफसी)का पूर्वअध्यक्ष मोहम्मद बिन हमामको भ्रष्टाचार मामला थापाले हमाम संग १ लाख डलर को अवैध उपहार लिएको खुलासा एसोसिएटेड प्रेसले गर्यो । उक्त रकम थापाको छोरा गौरव थापाको व्यक्तिगत बैंक खातामा जम्मा भएको थियो। [१] [2]

source: Once they learn the truth about the afterlife, they try to help others improve their moral behavior. Eventually they discover that no one has been admitted to the Good Place in centuries. They propose that the points system is fundamentally flawed and set up an experimental simulated Good Place to test their thesis that humans can develop morally with proper support.
ne: तेस्रो सत्रमा पृथ्वीमा फिर्ता पठाइएका मानिसहरू चिडी र उसको सहकर्मी सिमोनले आयोजना गरेका अनुसन्धानमा भाग लिन्छन् । मृत्युपश्चातको जीवनबारे थाहा पाएपछि उनीहरूले अरूहरूको नैतिकता सुधार्न सहयोग गर्छन् । अन्ततः उनीहरूले केही शताब्दीदेखि "गूड प्लेस" मा कोही पनि नपठाइएको कुरा थाहा पाउँछन् । उनीहरूले वर्तमान अङ्क प्रणालीमा त्रुटी छ भनी मानिसहरूले उचित सहयोग पाए सुध्रिन सक्छन् भन्ने सिद्धान्त प्रमाणित गर्न एउटा प्रयोगात्मक "गूड प्लेस" को निर्माण गर्छन् ।

source: In the final season, the year-long experiment eventually proves that humans can show moral improvement in the afterlife. The group institutes a new system whereby deceased humans will earn their way into the Good Place by passing tests of moral development; and then, to avoid becoming numbed by the ennui of eternal bliss, humans may choose to exit the Good Place and peacefully end their afterlife. In the final episode, Jason, Chidi, and Eleanor eventually choose to exit; Tahani becomes a designer of afterlife environments, and Michael is allowed to be sent to Earth to live as a human.
ne: अन्तिम सत्रनमा उनीहरूको परीक्षणले मानिसहरूले मृत्युपश्चातको जीवनमा पनि नैतिक सुधार देखाउन सक्छन् भन्ने उनीहरूको सिद्धान्त प्रमाणित गर्छ । उनीहरूले मृत्युपश्चातको जीवनमा नयाँ प्रणालीको सुरुवात गर्छन्, जहाँ मृत मानिसहरूले नैतिक सुधार देखाउने परीक्षाहरू पास गरेपछि उनीहरूलाई "गूड प्लेस" मा पठाइन्छ । परम आनन्दको सुस्तीले सुन्न नहुनका लागि मानिसहरू "गूड प्लेस" बाट बाहिरिने प्रावधान बनाइएको छ । शृंखलाको अन्तिम भागमा जेसन, चिडी र एलेनोर बाहिरिन्छन् । टहानी मृत्युपश्चातको जीवनको छिमेक बनाउनमा लाग्छिन् । माइकललाई मानिसको रूपमा आफ्नो जीवन बिताउन पृथ्वी पठाइन्छ ।

source: Cast and characters
ne: अभिनेता र पात्रहरू

source: Kristen Bell portrays series protagonist Eleanor Shellstrop.
ne: क्रिस्टेन बेलले शृंखलाको मुख्य पात्र एलेनोर शेलस्ट्रपको भूमिका खेल्छिन् ।

source: The cast of The Good Place at the 2018 San Diego Comic-Con
ne: द गूड प्लेसका नायकहरू सन् २०१८ को स्यान डिएगो कमिक कनमा ।

source: In order to earn her spot, she recruits Chidi to teach her the fundamentals of becoming a better person.[11][12] William Jackson Harper as Chidi Anagonye, a deceased professor of ethics and moral philosophy from Senegal. Assigned as Eleanor's soulmate in Michael's first Good Place experiment, he gives her ethics lessons in an attempt to make her a better person.[13] Jameela Jamil as Tahani Al-Jamil, a deceased wealthy British philanthropist who believes she belongs in the Good Place. She forms an unlikely friendship with Eleanor, who initially dislikes her positive attitude, condescending way of speaking, and tendency to name drop.[14] D'Arcy Carden as Janet, a programmed guide and knowledge bank who acts as the Good Place's main source of information and can provide its residents with whatever they desire.
ne: क्रिस्टेन बेल एलेनोर शेलस्ट्रपको रूपमा । एलेनोर फिनिक्स, एरिजोनाकी मृत, स्वार्थी बिक्री महिला हुन्, जो गल्तीले "गूड प्लेस" मा पुग्छिन् । आफ्नो स्थान कमाउनका लागि उनले राम्रो व्यक्ति बन्ने आधारभूत शिक्षा लिन चिडीलाई भर्ती गर्छिन् ।[१] [२] विलियम ज्याक्सन हार्पर चिडी आनागोन्येको रूपमा । चिडी सेनेगलका मृत नीति शिक्षाका प्राध्यापक हुन् । माइकलको पहिलो "गूड प्लेस" परीक्षणमा एलेनोरको आत्मीयजनको रूपमा तोकिएका चिडीले एलेनोरलाई राम्रो मान्छे बनाउने उद्देश्यले नीति शिक्षा पढाउँछन् ।[]] जमीला जमील टहानी अल-जमीलको रूपमा । टहानी मृत, धनी बेलायती परोपकारी हुन्, जसले "गूड प्लेस" मा दृढ विश्वास गर्छिन् । उनी एलेनोरकी असम्भाव्य मैत्री बन्छिन्, जसले पहिले उनको सकारात्मक सोच र आफ्ना प्रख्यात साथीहरूको नाम कुराकानीको बिचमा ल्याउने बानीलाई घृणा गर्छिन् ।[]] डार्सी कार्डेन ज्यानेटको रूपमा । ज्यानेट एक कृत्रिम बौद्धिकताले निर्मित मार्गदर्शक हुन्, जसले "गूड प्लेस" का मानिसहरूले चाहेका जानकारीहरू प्रदान गर्छिन् । शृंखला चल्दै जाँदा ज्यानेटले मानवीय स्वभाव हासिल गर्छिन्, जसले गर्दा उनको व्यवहारमा परिवर्तन आउँछ । कार्डेनले शृंखलाको अन्तरलमा विभिन्न प्रकारका ज्यानेटको भूमिका खेल्छिन् । तीमध्ये "ब्याड प्लेस" का राक्षसहरूले निर्माण गरेका अभद्र "ब्याड ज्यानेट"[]] ; लेखापाल कार्यालयको निस्पक्ष र तटस्ठ "न्युट्रल ज्यानेट"[]] ; रमणीय "डिस्को ज्यानेट" र एउटा भागको लागि एलेनोर, चिडी, टहानी र जेसनका ज्यानेट संस्करण पनि खेल्छिन् ।[]] म्यानी जसिन्टो जेसन मेन्डोजाको रूपमा । जेसन ज्याक्सनभिल, फ्लोरिडाका मृत, अव्यावसायिक डिस्क जकी र लागु पदार्थका दलाल हुन्, जो गल्तीले "गूड प्लेस" मा पुग्छन् । उनलाई ताइवाणका मौन धारण गरेका भिक्षु जियान्यु लिका रूपमा चिनाइएको थियो । पछि जेसनलाई अपरिपक्व र बोधो तर दयालु ज्याक्सनभिल ज्याग्वार्स र ब्लेक बोर्टल्सका प्रशंसकको रूपमा चित्रण गरिन्छ ।[]] टेड ड्यानसन माइकलको रूपमा । माइकल "ब्याड प्लेस" का योजनाकार हुन् जसले एलेनोर, चिडी, टहानी र जेसन बस्ने "गूड प्लेस" छिमेक चलाउँछन् । माइकललाई कागत बढ्ने क्लिपसँग खेल्ने र गाडीको चाबी खोज्नेजस्ता मानव जीवनका उराठलाग्दा पक्षहरू मन पर्छन् । शृंखलाको प्रथम सत्रको अन्तिम भागमा माइकलले मानिसहरूलाई यातना दिन त्यस छिमेकको निर्माण गरेको खुलासा हुन्छ । हिब्रुमा "माइकल" को अर्थ "भगवान जस्तो" हो । माइकलको पात्र देवदूत माइकलमा आधारित छ ।[१०]

source: Demons
ne: राक्षसहरू

source: He makes a return in the third season posing as an overenthusiastic member of Chidi's academic study on Earth, only to be later exiled by the Judge upon being discovered.[21] Marc Evan Jackson as Shawn, Michael's wicked boss. Shawn gives Michael two chances to pull off the torture experiment and later turns against him when he finds out about Michael's betrayal.[22] Luke Guldan as Chris Baker, a muscular Bad Place demon assigned as Eleanor's soulmate in the second attempt.[23] Chris was sent to the experimental Good Place disguised as "Linda". His mission was to distract Eleanor and the others so the Bad Place could kidnap Good Janet and replace her with a Bad Janet.
ne: टिया सिर्कार विक्कीको रूपमा । विक्की एक "ब्याड प्लेस" की राक्षस हुन् जसले प्रथम सत्रमा "गूड प्लेस" मा हुनुपर्ने "रियल एलेनोर शेलस्ट्रप" को भूमिका खेल्छिन् । दोस्रो सत्रमा माइकलका योजनाहरू बारम्बार असफल भएपछि उनले माइकलको छिमेकलाई आफ्नो अधीनमा ल्याउन खोज्छिन् । शृंखलाको अन्त्यतिर माइकलले उनलाई अन्य राक्षसहरूलाई मृत्युपश्चातको जीवनका संसोधित प्रणालीको परिचय गराउने काम दिन्छन् । एडम स्कट ट्रेभरको रूपमा । ट्रेभर "ब्याड प्लेस" का राक्षस हुन्, जसले मुख्य समूहलाई चिधाउँछन् । तेस्रो सत्रमा उनी चिडीको शैक्षिक समूहको उत्तेजित सदस्यका रूपमा फर्किन्छन्, जसको बारेमा थाहा पाएपछि न्यायाधीशले उनलाई निर्वासित गरिदिन्छन् ।[१] मार्क इभान ज्याक्सन शनको रूपमा । शन माइकलका दुष्ट हाकिम हुन् । उनले माइकललाई आफ्नो यातना परीक्षण सफल पर्न दुइटा अवसर दिन्छन्, तर माइकलले उनलाई धोका दिएको थाहा पाएपछि उनी माइकलको विपक्षमा पर्छन् ।[२] लुक गल्डन क्रिस बेकारको रूपमा । उनी "ब्याड प्लेस" का बलिष्ट राक्षस हुन्, जसलाई दोस्रो प्रयासमा एलेनोरको आत्मीयजनको रूपमा नियुक्त गरिएको थियो ।[]] क्रिसलाई "लिन्डा" को रूपमा भेषमा प्रयोगात्मक राम्रो ठाउँमा पठाइएको थियो। उ"ब्याड प्लेस" का राक्षसहरूले "गूड ज्यानेट" लाई अपहरण गरी "ब्याड ज्यानेट" सँग प्रतिस्थापन गर्ने क्रममा क्रिसलाई प्रयोगात्मक "गूड प्लेस" मा "लिन्डा" को रूपमा एलेनोर र अरूहरूलाई अल्मलाउन पठाइएको थियो । जामा विलियमसन भ्यालको रूपमा । उनी "ब्याड प्लेस" का राक्षस र शनका सचिव हुन् । एमी ओकुडा गेलकाे रूपमा । उनी "ब्याड प्लेस" का राक्षस हुन्, जसले "गूड प्लेस" मा जेसिकाको भूमिका निर्वाह गर्छिन् । उनले मान्छेहरूप्रति शनले जस्तै लगाव भने देखाउँदैनन् । स्टिभ बर्ग चककाे रूपमा । उनी "ब्याड प्लेस" का राक्षस हुन्, जसले "गूड प्लेस" मा गनरको भूमिका निर्वाह गर्छन् । उनलाई मानिसहरूलाई चपाएर दण्ड दिन मन पर्छ । बाम्बजान बाम्बा बाम्बजानकाे रूपमा । उनी "ब्याड प्लेस" का एक चतुर राक्षस हुन्, जसले "गूड प्लेस" मा एउटा वकिलको भूमिका निर्वाह गर्छन् । जश सिगल ग्लेनको रूपमा । उनी एक "ब्याड प्लेस" राक्षस हुन्, जसले "गूड प्लेस" मा एउटा हँसमुख वासिन्दाको भूमिका निर्वाह गर्छन् । उनी अरू प्राणीहरूको लागि समानुभूति देखाउने राक्षसहरूमध्ये एक हुन् । उनी "टिङ्कर, टेलर, डिमन, स्पाइ" मा विस्फोट हुन्छन् । जो म्यान्ड टड्रिक "टड" हेम्पलको रूपमा । उनी एक लाभा राक्षस हुन्, जो मानव सुट लगाउन मान्दैनन् ।

source: It focuses on Eleanor Shellstrop (Kristen Bell), who arrives in the afterlife and is welcomed by Michael (Ted Danson) to "the Good Place", a highly selective Heaven-like utopia he designed, as a reward for her righteous life. However, she realizes that she was sent there by mistake and must hide her morally imperfect behavior while trying to become a better and more ethical person. William Jackson Harper, Jameela Jamil, and Manny Jacinto co-star as other residents of "the Good Place", together with D'Arcy Carden as Janet, an artificial being who assists Good Place residents.
ne: द गूड प्लेस माइकल श्यरले बनाएका अमेरिकी हास्य टेलिभिजन शृंखला हो । यो शृंखला सेप्टेम्बर १९, २०१६ देखि जनवरी ३०, २०२० सम्म एनबीसीमा प्रसारण गरिएको थियो । यो एलेनोर शेलस्ट्रप (क्रिस्टेन बेल) को मृत्युपश्चातको जीवनमा केन्द्रित छ, जहाँ उनलाई माइकल (टेड ड्यानसन) ले उनको धर्तीमा पुण्यकर्मको फलस्वरूप स्वर्गसमान "द गूड प्लेस" मा स्वागत गर्छन् । तर, एलेनोरले आफूलाई त्यहाँ गल्तीले पठाइएको हो भन्ने अनुभूति गरेर आफ्नो अनैतिक कामहरू लुकाउँदै राम्रो र नैतिक बन्न खोज्छिन् । विलियम ज्याक्सन हार्पर, जमीला जमील र म्यानी जसिन्टोले "द गूड प्लेस" का अन्य वासिन्दाहरूको भूमिका खेलेका छन् भने डार्सी कार्डेनले ती वासिन्दाहरूलाई सहयोग गर्ने कृत्रिम बौद्धिकता, ज्यानेटको भूमिका खेलेकी छन् ।

source: Humans
ne: मानिसहरू

source: Maribeth Monroe as Mindy St. Claire, a deceased corporate lawyer and addict whose cocaine-infused plans for a charity generated enough good points after her death that her point total fell right in-between the Good Place and the Bad Place. As a compromise, the Judge ruled that she would receive her own private Medium Place where everything is mediocre. Kirby Howell-Baptiste as Simone Garnett, an Australian neuroscientist and, briefly, Chidi's girlfriend.
ne: मेरिबेथ मन्रो मिन्डी सेन्ट क्लेरको रूपमा । उनी एक मृत कर्पोरेट वकिल हुन्, जसले लागु पदार्थको प्रयोग गर्दै आयोजना गरेका दान कार्यक्रमहरूको कारणले "गूड प्लेस" र "ब्याड प्लेस" को ठ्याक्क बिचमा पर्ने अङ्क प्राप्त गरिन् । यसको फलस्वरूप न्यायाधीशले उनको लागि "मिडियम प्लेस" को निर्माण गरिन्, जहाँ सबै कुरा मध्यस्थ स्थितिको छ । कर्बी हावेल-ब्यप्टिस्ट सिमोन गार्नेटको रूपमा । उनी एक अस्ट्रेलियन न्युरोलोजिस्ट हुन् जसले केही समयको लागि चिडीसँग मायाको सम्बन्ध राखेकी थिइन् । उनी प्रयोगात्मक "गूड प्लेस" मा पठाइएको दोस्रो व्यक्ति हुन् । युजिन कोर्डेरो स्टिभन "पिल्बोइ" पिलिएजको रूपमा । उनी जेसनका सबैभन्दा मिल्ने साथी हुन् । बेन लसन ल्यारी हेम्सवर्थको रूपमा । उनी हेम्सवर्थ दाजुभाइमध्ये चौथो हुन् र उनले केही समयको लागि टहानीसँग मायाको सम्बन्ध राख्छन् । उनी आकर्षक र सफल भए पनि आफूलाई निरन्तर अपमान गर्छन् । रेबेका हेजलवूड कमिला अल-जमीलको रूपमा । उनी टहानीकी अत्यन्तै सफल र प्रतिस्पर्धात्मक बहिनी हुन् । अजय मेहता वकास अल-जमीलकाे रूपमा । उनी टहानीका बुवा हुन् । अन्ना खाजा मनिषा अल-जमीलकाे रूपमा । उनी टहानीकी आमा हुन् । लेस्ली ग्रोसमान डन्ना शेलस्ट्रपको रूपमा । डन्ना एलेनोरकी स्वार्थी आमा हुन् । तेस्रो सत्रमा उनले नेवाडामा आफ्नी सौतेनी छोरीको पढाइमा चासो राख्ने आमाको रूपमा शान्ति पाएको खुलासा भयो । एन्जेला ट्रिमबर म्याडिसनको रूपमा । उनी एलेनोरसँगै बस्ने केटी हुन् । मेरिल ह्याथवे ब्रिट्नीको रूपमा । उनी एलेनोरसँगै बस्ने केटी हुन् । मिच नरिटो डङ्की डगको रूपमा । उनी जेसनका बोधो बुवा हुन् । केस्टन जन उजोको रूपमा । उनी चिडीको बाल्यकालका साथी हुन् । ब्र्यान्डन स्कट जोन्स जन विटनको रूपमा । उनी प्रयोगात्मक "गूड प्लेस" मा पठाइएको पहिलो व्यक्ति हुन् । जीवनमा उनी पत्रपत्रिकामा प्रख्यात व्यक्तिहरूबारे गफ लेख्थे । बेन कोल्डाइक ब्रेन्ट नोर्वल्ककाे रूपमा । उनी प्रयोगात्मक "गूड प्लेस" मा पठाइएका चौथो व्यक्ति हुन् । उनी सानैदेखि विशेषाधिकार प्राप्त भएकाले अहंकारी र जातिभेदी छन् । [[माइकल मक्कीन]] र नोआ गार्फिन्कल डग फोर्सेटको रूपमा । मृत्युपश्चातको जीवनको अङ्क प्रणाली झन्डै बुझ्ने मान्छे भनेर माइकलले फोर्सेटको भूमिका खेल्ने गार्फिन्कलका तस्वीर आफ्नो कार्यालयको भित्तामा झुन्दाउछन् । एउटा पछिल्लो भागमा माइकल मक्कीन आफ्नो जीवन राम्ररी बिताउन खोजेको बुढो फोर्सेटको रूपमा आउँछन् । अन्तिम भागमा फोर्सेटको रूपमा गार्फिन्कललाई देख्न सकिन्छ ।

source: Other celestial beings
ne: अन्य आकाशीय जीवहरू

source: Ostensibly wanting to help Eleanor and her friends, he is very hesitant to make any actual action and is overly deferential to any demands by the Bad Place in negotiations. Stephen Merchant as Neil, the manager in the Accounting office where all the life points are calculated. He reveals that nobody has been sent to the Good Place for about 500 years.
ne: जेसन मन्ट्जुकस डेरेकको रूपमा । डेरेक ज्यानेटले बनाएका राम्ररी काम नगर्ने कृत्रिम प्रेमी हुन् । माया रुडल्फ जेनको रूपमा । हाइड्रोजनलाई छोटो गरी जेन बनेको हो । उनी "गूड प्लेस" र "ब्याड प्लेस" बिच पर्ने सबै स्थानहरूको मामिलाहरू हेर्ने न्यायाधीश हुन् । माइक ओ'म्याली जेफ द डोरम्यानको रूपमा । उनी मृत्युपश्चातको जीवन र पृथ्वीको बिच रहेको धोकाको द्वारपाल हुन् । उनलाई भ्यागुताहरू मन पर्छ । ब्राड मोरिस म्याटको रूपमा । उनी "गूड प्लेस" र "ब्याड प्लेस" को बिचमा पर्ने लेखापाल कार्यालयमा काम गर्ने आत्मघाती लेखापाल हुन् । उनलाई एलेनोर र माइकलको परीक्षणमा लेखापालको जिम्मेवारी दिइएको थियो । पहिले उनी लेखापाल कार्यालयमा "अनौठो यौनसम्बन्धि कुराहरू" हेर्ने काम गर्थे । पौल श्यर चकको रूपमा । चक "गूड प्लेस" समितिका प्रमुख हुन् । एलेनोर र उनका साथीहरूलाई सहयोग गर्न चाहे पनि उनले कुनै कार्य गर्दैनन् र सम्झौतामा "ब्याड प्लेस" ले अघि सरेका प्रस्तावहरूलाई पनि सम्मान गर्छन् । स्टिभन मर्चेन्ट नीलको रूपमा । नील सबै व्यक्तिहरूको जीवनको अङ्क प्रदान गर्ने लेखापाल कार्यालयका प्रबन्धक हुन् । उनले ५०० वर्षदेखि कुनै पनि मान्छेलाई "गूड प्लेस" मा पठाइएको छैन भन्ने खुलासा गर्छन् ।

source: Casting
ne: कास्टिङ्ग

source: Series creator and executive producer Michael Schur
ne: शृंखलाका निर्माता माइकल श्यर ।

source: NBC issued a press release on August 13, 2015 announcing it had given the then-untitled show a 13-episode order based purely on a pitch by Michael Schur.[25] On January 12, 2016, it was announced that Kristen Bell and Ted Danson had been cast in the lead roles for the series. The first synopsis of the show was also released, stating that the show was set to revolve around Eleanor designing her own self-improvement course with Michael acting as her guide[2] – although the afterlife element had always been a part of the series, as Bell has stated she was aware of the first-season finale twist when she signed onto the show.[26]
ne: अगस्ट १३, २०१५ मा एनबीसीले माइकल श्यरको योजनामा आधारित एक बेनाम १३ भाग भएको टेलिभिजन शृंखला बनाउने घोषणा गर्दै प्रेस विज्ञप्ति प्रकाशन गरेको थियो ।[१] जनवरी १२, २०१६ मा क्रिस्टेन बेल र टेड ड्यानसनले उक्त शृंखलाका मुख्य पात्रहरूको भूमिका निर्वाह गर्ने घोषणा गरियो । शृंखलाको पहिलो परिसर पनि विमोचन गरियो, जसमा यो शृंखला माइकलको मार्गदर्शनमा एलेनोरको नैतिक सुधारमा केन्द्रित हुन्छ भनियो ।[२] को मृत्युपश्चातको जीवनमा यो शृंखला केन्द्रित भए पनि पहिलो सत्रको मोडबारे बेलले मुख्य भूमिका खेल्न मानेपछि मात्रै थाहा पाइन् रे । []]

source: In addition, the first season's twist ending and the show's exploration and creative use of ethics and philosophy have been positively received. The recognition earned the series a Peabody Award in 2019. The series has won two Hugo Awards for Best Dramatic Presentation, Short Form for the episodes "The Trolley Problem" and "Janet(s)".
ne: द गूड प्लेसले आफ्नो लेख, अभिनय र मौलिकताको लागि सकारात्मक समीक्षा पाएको छ । यसका साथै यसको प्रथम सत्रको अन्त्यमा आउने मोड तथा यस शृंखलामा छोएको नैतिकताको विषयलाई सबैले सकारात्मक रूपमा लिएका छन् । सन् २०१९ मा यस शृंखलाले पिबडी पुरस्कार प्राप्त गर्यो । "द ट्रली प्रब्लम" र "ज्यानेट्स" मा राम्रो प्रस्तुतिका लागि यस शृंखलाले दुइटा ह्युगो पुरस्कार हासिल गरेको छ ।

source: William Jackson Harper was cast as Chris on February 11, 2016,[1] though the character was renamed Chidi. Jameela Jamil was cast as Tessa on February 25, 2016,[2] and her character was renamed Tahani. On March 3, 2016, Manny Jacinto was revealed to have been cast as a "sweet and good-natured Jason" whose "dream is to make a living as a DJ in Southern Florida".[3] On March 14, 2016, D'Arcy Carden was cast in a series regular role that was announced as "Janet Della-Denunzio, a violin salesperson with a checkered past"[4] – although writer Megan Amram later admitted that this was an intentional hoax.[27]
ne: फेब्रुअरी ११, २०१६ मा विलियम ज्याक्सन हार्परलाई क्रिसको भूमिकामा राखिएको थियो, तर पछि उनको पात्रको नामलाई चिडी बनाइयो ।[१] फेब्रुअरी २६, २०१६ मा जमीला जमीललाई टेस्साको भूमिकामा राखिएको थियो, उनको पात्रको नाम टहानी बनाइयो ।[२] मार्च ३, २०१६ मा म्यानी जसिन्टोलाई "दयालु र राम्रो स्वभाव भएको जेसन" को भूमिका खेल्न ल्याइयो, जसको "दक्षिण फ्लोरिडामा डिस्क जकी बन्ने सपना छ ।" []] मार्च १४, २०१६ मा डार्सी कार्डेनले "शंकास्पद विगत भएको बेला बिक्रेता ज्यानेट डेल्ला-डिनन्जियो" को भूमिका खेल्ने भनेर घोषणा गरियो । []] यद्यपि लेखक मेगन अम्रामले पछि यो मजाक भएको कुरा गरिन् ।[]]

source: The final premise for the show, including the afterlife element, was ultimately announced on May 15, 2016 when NBC announced its schedule for the 2016–17 TV season.[28]
ne: शृंखलाको मृत्युपश्चातको जीवनसहितको अन्तिम परिसर मे १५, २०१६ मा घोषणा भएको थियो जब एनबीसीले आफ्नो २०१६-१७ मा आउने शृंखलाहरूको घोषणा गर्यो ।[१]

source: According to Schur, the premise and idea was to include religious elements into the series after doing research on various faiths and groups, but he decided to scrap the plans, instead going for a concept that included all faiths that was diverse and free of religious views. "I stopped doing research because I realized it's about versions of ethical behavior, not religious salvation," he says. "The show isn't taking a side, the people who are there are from every country and religion."
ne: सुरुमा श्यरले विभिन्न धार्मिक समूह र आस्थाको अनुसन्धान गरेर शृंखलामा धार्मिक तत्त्वहरू समावेश गर्ने विचार गरेका थिए तर पछि धर्म निरपेक्ष आस्थाको अवधारणाको छनोट गरे । उनले यस शृंखलाको शुटिङ्ग गरेको स्यान म्यरिनो, क्यालिफोर्निया देख्दा पनि सबै समुदायको समावेश देखे, जसले उनको यो निश्चय अझै दृढ हुँदै गयो । उनले धार्मिक उद्धारको साटो नैतिकतामा आधारित गर्दा यस शृंखलामा सबै समुदायका मानिसहरू एकअर्कासँग घुलमिल भएको देख्न पाइन्छ ।[१]

source: Broadcast and release
ne: प्रसारण र विमोचन

source: The series premiered on September 19, 2016.[35] On January 30, 2017, NBC renewed the series for a second season of 13 episodes, which premiered on Wednesday, September 20, 2017 with an hour-long premiere before moving to its normal time slot on Thursday at 8:30 pm beginning September 28, 2017.[36] On November 21, 2017, NBC renewed the series for a 13-episode third season, which premiered on September 27, 2018.[37][38] On December 4, 2018, NBC renewed the series for a fourth season.[39] On June 7, 2019, it was announced that the fourth season would be the last.[9] Season 4 premiered on September 26, 2019.[10]
ne: यो शृंखलाको पहिलो प्रसारण सेप्टेम्बर १९, २०१६ मा भएको थियो ।[१] जनवरी ३०, २०१७ मा एनबीसीले यसलाई १३ भागको दोस्रो सत्रको लागि नवीकरण गर्यो, जसलाई सेप्टेम्बर २०, २०१७ मा बुधबारको दिन प्रसारण समय सेप्टेम्बर २८, २०१७ मा बिहिबार राति साँढे ८ बजेमा परिणत गर्नु अघि एक घण्टा लामो प्रसारण गरियो ।[२] डिसेम्बर ४, २०१८ मा एनबीसीले यस शृंखलालाई चौथो सत्रको लागि नवीकरण गर्यो ।[]] []] डिसेम्बर,, २०१ 2018 मा, एनबीसीले चौथो सत्रको लागि श्रृंखला नविकरण गर्‍यो।[]] जून ७, २०१९ मा चौथो सत्र अन्तिम हुने घोषणा गरियो ।[]] सेप्टेम्बर २६, २०१९ मा चौथो सत्रको प्रसारण भयो ।[]]

source: In December 2018, NBC renewed the series for a fourth and final season, which premiered on September 26, 2019 and concluded on January 30, 2020.[1][2]
ne: सन् २०१८ को डिसेम्बरमा एनबीसीले यस शृंखलालाई चौथो र अन्तिम सिजनको लागि नवीकरण गर्यो, जुन सेप्टेम्बर २६, २०१९ मा सुरु भई जनवरी ३०, २०२० मा समाप्त भयो ।[१] [२]

source: In several international territories, the show is distributed on Netflix, and the first season was released on September 21, 2017 while episodes of subsequent seasons became available within 24 hours of its U.S. broadcast.[40][41]
ne: कयौँ अन्तर्राष्ट्रिय क्षेत्रहरूमा यस शृंखलालाई नेटफ्लिक्सद्वारा वितरण गरियो । शृंखलाको प्रथम सत्र सेप्टेम्बर २१, २०१७ मा विमोचन भएको थियो भने अन्य भागहरू अमेरिकामा प्रसारित भएको २४ घण्टा भित्र उपलब्ध भए ।[१] [२]

source: Home media
ne: घरेलु मिडिया

source: All the DVD releases for The Good Place were distributed by the Shout! Factory. The first season was released on DVD in region 1 on October 17, 2017.[42] The second season was released on DVD on July 17, 2018.[43] The third season was released on DVD on July 30, 2019.[44]
ne: द गूड प्लेसका सबै डि भी डिहरू शाउट! फ्याक्ट्रीद्वारा वितरण भएको थियो । अक्टोबर १७, २०१७ मा प्रथम सत्रलाई डि भी डि क्षेत्र १ (अमेरिका, पोर्टो रिको, क्यानाडा र बर्मुडा) मा प्रसारण गरिएको थियो ।[१] जुलाई १७, २०१८ मा डि भी डिमा दोस्रो सत्रको प्रसारण गरियो । [२]जुलाई ३०, २०१९ मा डि भी डिमा तेस्रो सत्रको प्रसारण भयो ।[]]

source: The complete series was released on Blu-ray on May 19, 2020.[45]
ne: सम्पूर्ण शृंखलालाई मे १९, २०२० मा ब्लू-रेमा प्रसारण गरियो ।[१]

source: Ted Danson's performance on the series has received critical acclaim.
ne: श्रृंखलामा टेड डेन्सनको प्रदर्शन प्रशंसा प्राप्त भएको छ ।

source: Season Critical response Rotten Tomatoes Metacritic 1 92% (71 reviews) 78 (32 reviews) 2 100% (58 reviews) 87 (10 reviews) 3 98% (47 reviews) 96 (5 reviews) 4 100% (21 reviews) N/A
ne: सत्र आलोचनात्मक प्रतिक्रिया रटन टमेटोज मेटाक्रिटिक १ ९२% (७१ समिक्षाहरू) ७८ (३२ समीक्षाहरू) २ १००% (५८ समीक्षाहरू) ८७ (१० समीक्षाहरू) ३ ९८% (४७ समीक्षाहरू) ९६ (५ समीक्षाहरू) ४ १००% (२१ समीक्षाहरू) N/A
